app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "following", "name", "provider", "secret", "token", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = 'tumblr' AND "users"."uid" = 'g-mainak' LIMIT 1
---
	def create
		auth = request.env["omniauth.auth"]
		user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)

UPDATE "users" SET "following" = '---
---
			blogs.concat x
		end
		user.following = blogs
		user.save